package YKtasks;
/*
Написать программу которая будет выводить цифры от 1 до 5 используя цикл for
 */
public class task6 {
    public static void main(String[] args) {

for (int i = 1; i <=5; i++) {
    System.out.println(i);
}
    }
}
